Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd
l =[4, 8, 15, 16, 23,42]
print(pd.Series(l))

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [2]:
l1 =range(5,15)
print(pd.Series(l1))

0     5
1     6
2     7
3     8
4     9
5    10
6    11
7    12
8    13
9    14
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:

Name   Alice  Bob  Claire

Age     25    30    27

Gender Female Male Female


Then, print the DataFrame.

In [3]:
dict1={"Name": ['Alice', 'Bob' ,'Claire'],
            "Age":[25,30,27],
            "Gender":["Female","Male","Female"]}
pd.DataFrame(dict1)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

DataFrame is a 2 dimensional data structures. Series is a one-dimensional labeled array of the same data type whereas DataFrame is a 2-dimensional labeled data structure with columns of potentially different types. In a DataFrame, each column of data is represented as a pandas Series.

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

Ans5 - Some common functions to manipulate data in Pandas are read(),describe(),head(),tail() etc

In [4]:
a= pd.read_excel('list-national-capitals.xls')

In [5]:
a.describe()

        SNo                Country Capital City                       Notes
count   246                    244          259                          62
unique  246                    244          256                          33
top       1   United Arab Emirates      Nicosia  British Overseas Territory
freq      1                      1            2                          10

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Ans6 - All the three Series, DataFrame,Panel are value mutuable that is we can add/delete the values
        But only series is size immutable, i.e there can be only one column in series.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [8]:
data1=[1,2,3,4]
data2 =["zuk","VK","SK","PK"]
data3 = [25,27,28,30]
dd1= pd.Series(data1)
dd2= pd.Series(data2)
dd3= pd.Series(data3)
pd.DataFrame({"S.no":dd1,"name":dd2,"Age":dd3})

   S.no name  Age
0     1  zuk   25
1     2   VK   27
2     3   SK   28
3     4   PK   30